#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/eggs-projects/infra/runs/run-emm8qyq2tpkiCppV

Waiting for the plan to start...

Terraform v1.1.8
on linux_amd64
Initializing plugins and modules...
module.tfe_prod.tfe_workspace.projects["ghost-blog"]: Refreshing state... [id=ws-L1LBC3UZSEpVPgEX]
module.tfe_dev.tfe_workspace.projects["test-repo"]: Refreshing state... [id=ws-SfnrJgVt5Pa4qND4]
module.tfe_dev.tfe_workspace.projects["ghost-blog"]: Refreshing state... [id=ws-PYgtf5qUjmec5gC1]
github_repository.projects["test-repo"]: Refreshing state... [id=test-repo]
github_repository.projects["ghost-blog"]: Refreshing state... [id=ghost-blog]
module.tfe_prod.tfe_variable.project_name["ghost-blog"]: Refreshing state... [id=var-oZyN63DNurs5WPLQ]
module.tfe_prod.tfe_variable.organization["ghost-blog"]: Refreshing state... [id=var-xrNqsqt3n2n7PCvi]
module.tfe_prod.tfe_variable.route53_hosted_zone_name["ghost-blog"]: Refreshing state... [id=var-41JsaZjphGtmPrem]
module.tfe_prod.tfe_variable.aws_account_id["ghost-blog"]: Refreshing state... [id=var-93W25tcmfs3Ns2Du]
module.tfe_dev.tfe_variable.project_name["ghost-blog"]: Refreshing state... [id=var-wjmUtCLRhNCGCg9T]
module.tfe_dev.tfe_variable.project_name["test-repo"]: Refreshing state... [id=var-VjfYSMYJZ1TRUeip]
module.tfe_dev.tfe_variable.aws_account_id["test-repo"]: Refreshing state... [id=var-KkpSpXMqfuymYhhZ]
module.tfe_dev.tfe_variable.aws_account_id["ghost-blog"]: Refreshing state... [id=var-EXXLQJDkhTjrPinc]
module.tfe_dev.tfe_variable.organization["ghost-blog"]: Refreshing state... [id=var-VtNpGj8Uznax9iT7]
module.tfe_dev.tfe_variable.organization["test-repo"]: Refreshing state... [id=var-rL5FG1o3nyvDcw3a]
module.tfe_dev.tfe_variable.route53_hosted_zone_name["ghost-blog"]: Refreshing state... [id=var-74wqJmApSP355PtE]
module.tfe_dev.tfe_variable.route53_hosted_zone_name["test-repo"]: Refreshing state... [id=var-QocBoKWYgndBj8UC]
github_actions_secret.tf_api_token["ghost-blog"]: Refreshing state... [id=ghost-blog:TF_API_TOKEN]
github_actions_secret.tf_api_token["test-repo"]: Refreshing state... [id=test-repo:TF_API_TOKEN]
github_repository_environment.prod["ghost-blog"]: Refreshing state... [id=ghost-blog:prod]
github_repository_environment.dev["ghost-blog"]: Refreshing state... [id=ghost-blog:dev]
module.aws_prod.aws_iam_policy.route53_record_updates: Refreshing state... [id=arn:aws:iam::174199678932:policy/eggs-projects-deploy-route53-policy]
module.aws_prod.aws_iam_user.projects["ghost-blog"]: Refreshing state... [id=eggs-projects-ghost-blog-user]
module.aws_prod.aws_iam_role.admin_role: Refreshing state... [id=eggs-projects-admin-role]
module.aws_prod.aws_iam_access_key.projects["ghost-blog"]: Refreshing state... [id=AKIASRDY4E7KPUBNHI73]
module.aws_prod.aws_iam_role.deploy: Refreshing state... [id=eggs-projects-deploy-role]
module.tfe_prod.tfe_variable.access_key["ghost-blog"]: Refreshing state... [id=var-Pr4pju9ToTAB6Pov]
module.tfe_prod.tfe_variable.secret_key["ghost-blog"]: Refreshing state... [id=var-7SdEEzBG6XSrG4ym]
module.aws_dev.aws_iam_user.admin[0]: Refreshing state... [id=eggs-projects-admin]
module.aws_dev.aws_iam_user.projects["test-repo"]: Refreshing state... [id=eggs-projects-test-repo-user]
module.aws_dev.aws_iam_role.admin_role: Refreshing state... [id=eggs-projects-admin-role]
module.aws_dev.aws_iam_user.projects["ghost-blog"]: Refreshing state... [id=eggs-projects-ghost-blog-user]
module.aws_dev.aws_iam_policy.route53_record_updates: Refreshing state... [id=arn:aws:iam::470292911211:policy/eggs-projects-deploy-route53-policy]
module.aws_dev.aws_iam_access_key.projects["test-repo"]: Refreshing state... [id=AKIAW275EKRVZ3MHLWVG]
module.aws_dev.aws_iam_access_key.projects["ghost-blog"]: Refreshing state... [id=AKIAW275EKRVY4W47SUK]
module.aws_dev.aws_iam_role.deploy: Refreshing state... [id=eggs-projects-deploy-role]
module.aws_prod.aws_iam_role_policy_attachment.AmazonEC2FullAccess: Refreshing state... [id=eggs-projects-deploy-role-20221126031544389000000002]
module.aws_prod.aws_iam_user_policy.projects["ghost-blog"]: Refreshing state... [id=eggs-projects-ghost-blog-user:eggs-projects-ghost-blog-assume-role-policy]
module.aws_prod.aws_iam_role_policy_attachment.route53_record_updates: Refreshing state... [id=eggs-projects-deploy-role-20221126031544382100000001]
module.aws_dev.aws_iam_user_policy.admin_dev[0]: Refreshing state... [id=eggs-projects-admin:eggs-projects-admin-assume-role-policy]
module.aws_dev.aws_iam_user_policy.admin[0]: Refreshing state... [id=eggs-projects-admin:eggs-projects-admin-assume-role-policy]
module.tfe_dev.tfe_variable.secret_key["test-repo"]: Refreshing state... [id=var-nfehnNRmmscGF9Ki]
module.tfe_dev.tfe_variable.secret_key["ghost-blog"]: Refreshing state... [id=var-VwUvW23HYCN64iWj]
module.tfe_dev.tfe_variable.access_key["ghost-blog"]: Refreshing state... [id=var-y9b3DuqXBA3u8QeU]
module.tfe_dev.tfe_variable.access_key["test-repo"]: Refreshing state... [id=var-sJ9VXSjcxCKzXZnx]
module.aws_dev.aws_iam_role_policy_attachment.route53_record_updates: Refreshing state... [id=eggs-projects-deploy-role-20221124021210474500000001]
module.aws_dev.aws_iam_user_policy.projects["test-repo"]: Refreshing state... [id=eggs-projects-test-repo-user:eggs-projects-test-repo-assume-role-policy]
module.aws_dev.aws_iam_user_policy.eggs_cli[0]: Refreshing state... [id=eggs-cli:eggs-cli-deploy-assume-role-policy]
module.aws_dev.aws_iam_role_policy_attachment.AmazonEC2FullAccess: Refreshing state... [id=eggs-projects-deploy-role-20221123030841241800000001]
module.aws_dev.aws_iam_user_policy.projects["ghost-blog"]: Refreshing state... [id=eggs-projects-ghost-blog-user:eggs-projects-ghost-blog-assume-role-policy]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_repository.projects["ghost-blog"] has changed
  ~ resource "github_repository" "projects" {
      ~ etag                        = "W/\"dd6b1dcabc9c7ad7a2c046d7dfb27947c2cc7b349494b4e5a0ac2c0fb3ff21be\"" -> "W/\"e91f3df2fe2ccf678d62ef5467a317f5190c016a51c12fac4e113fc646295818\""
        id                          = "ghost-blog"
        name                        = "ghost-blog"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.aws_dev.aws_iam_policy.route53_record_updates has changed
  ~ resource "aws_iam_policy" "route53_record_updates" {
        id          = "arn:aws:iam::470292911211:policy/eggs-projects-deploy-route53-policy"
        name        = "eggs-projects-deploy-route53-policy"
      ~ tags        = {
          + "repo" = "https://github.com/michaeldeggers/infra"
        }
        # (6 unchanged attributes hidden)
    }

  # module.aws_dev.aws_iam_role.admin_role has changed
  ~ resource "aws_iam_role" "admin_role" {
        id                    = "eggs-projects-admin-role"
        name                  = "eggs-projects-admin-role"
      ~ tags                  = {
          + "repo" = "https://github.com/michaeldeggers/infra"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.aws_dev.aws_iam_role.deploy has changed
  ~ resource "aws_iam_role" "deploy" {
        id                    = "eggs-projects-deploy-role"
        name                  = "eggs-projects-deploy-role"
      ~ tags                  = {
          + "repo" = "https://github.com/michaeldeggers/infra"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.aws_dev.aws_iam_user.admin[0] has changed
  ~ resource "aws_iam_user" "admin" {
        id            = "eggs-projects-admin"
        name          = "eggs-projects-admin"
      ~ tags          = {
          + "repo" = "https://github.com/michaeldeggers/infra"
        }
        # (5 unchanged attributes hidden)
    }

  # module.aws_dev.aws_iam_user.projects["ghost-blog"] has changed
  ~ resource "aws_iam_user" "projects" {
        id            = "eggs-projects-ghost-blog-user"
        name          = "eggs-projects-ghost-blog-user"
      ~ tags          = {
          + "repo" = "https://github.com/michaeldeggers/infra"
        }
        # (5 unchanged attributes hidden)
    }

  # module.aws_dev.aws_iam_user.projects["test-repo"] has changed
  ~ resource "aws_iam_user" "projects" {
        id            = "eggs-projects-test-repo-user"
        name          = "eggs-projects-test-repo-user"
      ~ tags          = {
          + "repo" = "https://github.com/michaeldeggers/infra"
        }
        # (5 unchanged attributes hidden)
    }

  # module.aws_prod.aws_iam_policy.route53_record_updates has changed
  ~ resource "aws_iam_policy" "route53_record_updates" {
        id          = "arn:aws:iam::174199678932:policy/eggs-projects-deploy-route53-policy"
        name        = "eggs-projects-deploy-route53-policy"
      ~ tags        = {
          + "repo" = "https://github.com/michaeldeggers/infra"
        }
        # (6 unchanged attributes hidden)
    }

  # module.aws_prod.aws_iam_role.admin_role has changed
  ~ resource "aws_iam_role" "admin_role" {
        id                    = "eggs-projects-admin-role"
        name                  = "eggs-projects-admin-role"
      ~ tags                  = {
          + "repo" = "https://github.com/michaeldeggers/infra"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.aws_prod.aws_iam_role.deploy has changed
  ~ resource "aws_iam_role" "deploy" {
        id                    = "eggs-projects-deploy-role"
        name                  = "eggs-projects-deploy-role"
      ~ tags                  = {
          + "repo" = "https://github.com/michaeldeggers/infra"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.aws_prod.aws_iam_user.projects["ghost-blog"] has changed
  ~ resource "aws_iam_user" "projects" {
        id            = "eggs-projects-ghost-blog-user"
        name          = "eggs-projects-ghost-blog-user"
      ~ tags          = {
          + "repo" = "https://github.com/michaeldeggers/infra"
        }
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_actions_secret.tf_api_token["eks-cluster"] will be created
  + resource "github_actions_secret" "tf_api_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "eks-cluster"
      + secret_name     = "TF_API_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_repository.projects["eks-cluster"] will be created
  + resource "github_repository" "projects" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "EKS Configuration for hosting Projects"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "eks-cluster"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }

      + template {
          + include_all_branches = false
          + owner                = "michaeldeggers"
          + repository           = "repo_template"
        }
    }

  # github_repository_environment.dev["eks-cluster"] will be created
  + resource "github_repository_environment" "dev" {
      + environment = "dev"
      + id          = (known after apply)
      + repository  = "eks-cluster"

      + deployment_branch_policy {
          + custom_branch_policies = false
          + protected_branches     = true
        }
    }

  # github_repository_environment.prod["eks-cluster"] will be created
  + resource "github_repository_environment" "prod" {
      + environment = "prod"
      + id          = (known after apply)
      + repository  = "eks-cluster"

      + deployment_branch_policy {
          + custom_branch_policies = false
          + protected_branches     = true
        }

      + reviewers {
          + users = [
              + 31218645,
            ]
        }
    }

  # module.aws_dev.aws_iam_access_key.projects["eks-cluster"] will be created
  + resource "aws_iam_access_key" "projects" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "eggs-projects-eks-cluster-user"
    }

  # module.aws_dev.aws_iam_policy.route53_record_updates will be updated in-place
  ~ resource "aws_iam_policy" "route53_record_updates" {
        id          = "arn:aws:iam::470292911211:policy/eggs-projects-deploy-route53-policy"
        name        = "eggs-projects-deploy-route53-policy"
      ~ tags        = {
          - "repo" = "https://github.com/michaeldeggers/infra" -> null
        }
      ~ tags_all    = {
          + "github_org"  = "michaeldeggers"
          + "github_repo" = "infra"
          - "repo"        = "https://github.com/michaeldeggers/infra" -> null
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.aws_dev.aws_iam_role.admin_role will be updated in-place
  ~ resource "aws_iam_role" "admin_role" {
        id                    = "eggs-projects-admin-role"
        name                  = "eggs-projects-admin-role"
      ~ tags                  = {
          - "repo" = "https://github.com/michaeldeggers/infra" -> null
        }
      ~ tags_all              = {
          + "github_org"  = "michaeldeggers"
          + "github_repo" = "infra"
          - "repo"        = "https://github.com/michaeldeggers/infra" -> null
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.aws_dev.aws_iam_role.deploy will be updated in-place
  ~ resource "aws_iam_role" "deploy" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ AWS = [
                                "arn:aws:iam::470292911211:user/eggs-cli",
                              + "arn:aws:iam::470292911211:user/eggs-projects-eks-cluster-user",
                                "arn:aws:iam::470292911211:user/eggs-projects-ghost-blog-user",
                                # (1 unchanged element hidden)
                            ]
                        }
                        # (3 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        id                    = "eggs-projects-deploy-role"
        name                  = "eggs-projects-deploy-role"
      ~ tags                  = {
          - "repo" = "https://github.com/michaeldeggers/infra" -> null
        }
      ~ tags_all              = {
          + "github_org"  = "michaeldeggers"
          + "github_repo" = "infra"
          - "repo"        = "https://github.com/michaeldeggers/infra" -> null
            # (1 unchanged element hidden)
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.aws_dev.aws_iam_user.admin[0] will be updated in-place
  ~ resource "aws_iam_user" "admin" {
        id            = "eggs-projects-admin"
        name          = "eggs-projects-admin"
      ~ tags          = {
          - "repo" = "https://github.com/michaeldeggers/infra" -> null
        }
      ~ tags_all      = {
          + "github_org"  = "michaeldeggers"
          + "github_repo" = "infra"
          - "repo"        = "https://github.com/michaeldeggers/infra" -> null
            # (1 unchanged element hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.aws_dev.aws_iam_user.projects["eks-cluster"] will be created
  + resource "aws_iam_user" "projects" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "eggs-projects-eks-cluster-user"
      + path          = "/"
      + tags_all      = {
          + "environment" = "development"
          + "github_org"  = "michaeldeggers"
          + "github_repo" = "infra"
        }
      + unique_id     = (known after apply)
    }

  # module.aws_dev.aws_iam_user.projects["ghost-blog"] will be updated in-place
  ~ resource "aws_iam_user" "projects" {
        id            = "eggs-projects-ghost-blog-user"
        name          = "eggs-projects-ghost-blog-user"
      ~ tags          = {
          - "repo" = "https://github.com/michaeldeggers/infra" -> null
        }
      ~ tags_all      = {
          + "github_org"  = "michaeldeggers"
          + "github_repo" = "infra"
          - "repo"        = "https://github.com/michaeldeggers/infra" -> null
            # (1 unchanged element hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.aws_dev.aws_iam_user.projects["test-repo"] will be updated in-place
  ~ resource "aws_iam_user" "projects" {
        id            = "eggs-projects-test-repo-user"
        name          = "eggs-projects-test-repo-user"
      ~ tags          = {
          - "repo" = "https://github.com/michaeldeggers/infra" -> null
        }
      ~ tags_all      = {
          + "github_org"  = "michaeldeggers"
          + "github_repo" = "infra"
          - "repo"        = "https://github.com/michaeldeggers/infra" -> null
            # (1 unchanged element hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.aws_dev.aws_iam_user_policy.admin_dev[0] will be updated in-place
  ~ resource "aws_iam_user_policy" "admin_dev" {
        id     = "eggs-projects-admin:eggs-projects-admin-assume-role-policy"
        name   = "eggs-projects-admin-assume-role-policy"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                          - "arn:aws:iam::174199678932:role/eggs-projects-admin-role",
                          - "arn:aws:iam::470292911211:role/eggs-projects-admin-role",
                        ] -> "arn:aws:iam::470292911211:role/eggs-projects-admin-role"
                        # (2 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.aws_dev.aws_iam_user_policy.projects["eks-cluster"] will be created
  + resource "aws_iam_user_policy" "projects" {
      + id          = (known after apply)
      + name        = "eggs-projects-eks-cluster-assume-role-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:AssumeRole"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::470292911211:role/eggs-projects-deploy-role"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + user        = "eggs-projects-eks-cluster-user"
    }

  # module.aws_prod.aws_iam_access_key.projects["eks-cluster"] will be created
  + resource "aws_iam_access_key" "projects" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "eggs-projects-eks-cluster-user"
    }

  # module.aws_prod.aws_iam_policy.route53_record_updates will be updated in-place
  ~ resource "aws_iam_policy" "route53_record_updates" {
        id          = "arn:aws:iam::174199678932:policy/eggs-projects-deploy-route53-policy"
        name        = "eggs-projects-deploy-route53-policy"
      ~ tags        = {
          - "repo" = "https://github.com/michaeldeggers/infra" -> null
        }
      ~ tags_all    = {
          + "github_org"  = "michaeldeggers"
          + "github_repo" = "infra"
          - "repo"        = "https://github.com/michaeldeggers/infra" -> null
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.aws_prod.aws_iam_role.admin_role will be updated in-place
  ~ resource "aws_iam_role" "admin_role" {
        id                    = "eggs-projects-admin-role"
        name                  = "eggs-projects-admin-role"
      ~ tags                  = {
          - "repo" = "https://github.com/michaeldeggers/infra" -> null
        }
      ~ tags_all              = {
          + "github_org"  = "michaeldeggers"
          + "github_repo" = "infra"
          - "repo"        = "https://github.com/michaeldeggers/infra" -> null
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.aws_prod.aws_iam_role.deploy will be updated in-place
  ~ resource "aws_iam_role" "deploy" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ AWS = [
                              + "arn:aws:iam::174199678932:user/eggs-projects-eks-cluster-user",
                                "arn:aws:iam::174199678932:user/eggs-projects-ghost-blog-user",
                            ]
                        }
                        # (3 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        id                    = "eggs-projects-deploy-role"
        name                  = "eggs-projects-deploy-role"
      ~ tags                  = {
          - "repo" = "https://github.com/michaeldeggers/infra" -> null
        }
      ~ tags_all              = {
          + "github_org"  = "michaeldeggers"
          + "github_repo" = "infra"
          - "repo"        = "https://github.com/michaeldeggers/infra" -> null
            # (1 unchanged element hidden)
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.aws_prod.aws_iam_user.projects["eks-cluster"] will be created
  + resource "aws_iam_user" "projects" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "eggs-projects-eks-cluster-user"
      + path          = "/"
      + tags_all      = {
          + "environment" = "production"
          + "github_org"  = "michaeldeggers"
          + "github_repo" = "infra"
        }
      + unique_id     = (known after apply)
    }

  # module.aws_prod.aws_iam_user.projects["ghost-blog"] will be updated in-place
  ~ resource "aws_iam_user" "projects" {
        id            = "eggs-projects-ghost-blog-user"
        name          = "eggs-projects-ghost-blog-user"
      ~ tags          = {
          - "repo" = "https://github.com/michaeldeggers/infra" -> null
        }
      ~ tags_all      = {
          + "github_org"  = "michaeldeggers"
          + "github_repo" = "infra"
          - "repo"        = "https://github.com/michaeldeggers/infra" -> null
            # (1 unchanged element hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.aws_prod.aws_iam_user_policy.projects["eks-cluster"] will be created
  + resource "aws_iam_user_policy" "projects" {
      + id          = (known after apply)
      + name        = "eggs-projects-eks-cluster-assume-role-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:AssumeRole"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::174199678932:role/eggs-projects-deploy-role"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + user        = "eggs-projects-eks-cluster-user"
    }

  # module.tfe_dev.tfe_variable.access_key["eks-cluster"] will be created
  + resource "tfe_variable" "access_key" {
      + category     = "env"
      + description  = "AWS Access Key"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.tfe_dev.tfe_variable.aws_account_id["eks-cluster"] will be created
  + resource "tfe_variable" "aws_account_id" {
      + category       = "terraform"
      + description    = "AWS Account ID"
      + hcl            = false
      + id             = (known after apply)
      + key            = "aws_account_id"
      + readable_value = "470292911211"
      + sensitive      = false
      + value          = (sensitive value)
      + workspace_id   = (known after apply)
    }

  # module.tfe_dev.tfe_variable.organization["eks-cluster"] will be created
  + resource "tfe_variable" "organization" {
      + category       = "terraform"
      + description    = "Project Organization"
      + hcl            = false
      + id             = (known after apply)
      + key            = "organization"
      + readable_value = "eggs-projects"
      + sensitive      = false
      + value          = (sensitive value)
      + workspace_id   = (known after apply)
    }

  # module.tfe_dev.tfe_variable.project_name["eks-cluster"] will be created
  + resource "tfe_variable" "project_name" {
      + category       = "terraform"
      + description    = "Project Name"
      + hcl            = false
      + id             = (known after apply)
      + key            = "project_name"
      + readable_value = "eks-cluster"
      + sensitive      = false
      + value          = (sensitive value)
      + workspace_id   = (known after apply)
    }

  # module.tfe_dev.tfe_variable.route53_hosted_zone_name["eks-cluster"] will be created
  + resource "tfe_variable" "route53_hosted_zone_name" {
      + category       = "terraform"
      + description    = "Project Name"
      + hcl            = false
      + id             = (known after apply)
      + key            = "route53_hosted_zone_name"
      + readable_value = "mikeeggers.com"
      + sensitive      = false
      + value          = (sensitive value)
      + workspace_id   = (known after apply)
    }

  # module.tfe_dev.tfe_variable.secret_key["eks-cluster"] will be created
  + resource "tfe_variable" "secret_key" {
      + category     = "env"
      + description  = "AWS Secret Access Key"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.tfe_dev.tfe_workspace.projects["eks-cluster"] will be created
  + resource "tfe_workspace" "projects" {
      + agent_pool_id                 = (known after apply)
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + auto_apply_run_trigger        = false
      + execution_mode                = (known after apply)
      + file_triggers_enabled         = true
      + force_delete                  = false
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "eggs-projects-eks-cluster"
      + operations                    = (known after apply)
      + organization                  = "eggs-projects"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "project",
        ]
      + terraform_version             = (known after apply)
    }

  # module.tfe_prod.tfe_variable.access_key["eks-cluster"] will be created
  + resource "tfe_variable" "access_key" {
      + category     = "env"
      + description  = "AWS Access Key"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.tfe_prod.tfe_variable.aws_account_id["eks-cluster"] will be created
  + resource "tfe_variable" "aws_account_id" {
      + category       = "terraform"
      + description    = "AWS Account ID"
      + hcl            = false
      + id             = (known after apply)
      + key            = "aws_account_id"
      + readable_value = "174199678932"
      + sensitive      = false
      + value          = (sensitive value)
      + workspace_id   = (known after apply)
    }

  # module.tfe_prod.tfe_variable.organization["eks-cluster"] will be created
  + resource "tfe_variable" "organization" {
      + category       = "terraform"
      + description    = "Project Organization"
      + hcl            = false
      + id             = (known after apply)
      + key            = "organization"
      + readable_value = "eggs-projects"
      + sensitive      = false
      + value          = (sensitive value)
      + workspace_id   = (known after apply)
    }

  # module.tfe_prod.tfe_variable.project_name["eks-cluster"] will be created
  + resource "tfe_variable" "project_name" {
      + category       = "terraform"
      + description    = "Project Name"
      + hcl            = false
      + id             = (known after apply)
      + key            = "project_name"
      + readable_value = "eks-cluster"
      + sensitive      = false
      + value          = (sensitive value)
      + workspace_id   = (known after apply)
    }

  # module.tfe_prod.tfe_variable.route53_hosted_zone_name["eks-cluster"] will be created
  + resource "tfe_variable" "route53_hosted_zone_name" {
      + category       = "terraform"
      + description    = "Project Name"
      + hcl            = false
      + id             = (known after apply)
      + key            = "route53_hosted_zone_name"
      + readable_value = "michaeldeggers.com"
      + sensitive      = false
      + value          = (sensitive value)
      + workspace_id   = (known after apply)
    }

  # module.tfe_prod.tfe_variable.secret_key["eks-cluster"] will be created
  + resource "tfe_variable" "secret_key" {
      + category     = "env"
      + description  = "AWS Secret Access Key"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.tfe_prod.tfe_workspace.projects["eks-cluster"] will be created
  + resource "tfe_workspace" "projects" {
      + agent_pool_id                 = (known after apply)
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + auto_apply_run_trigger        = false
      + execution_mode                = (known after apply)
      + file_triggers_enabled         = true
      + force_delete                  = false
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "eggs-projects-eks-cluster_prod"
      + operations                    = (known after apply)
      + organization                  = "eggs-projects"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "project",
        ]
      + terraform_version             = (known after apply)
    }

Plan: 24 to add, 11 to change, 0 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 15 estimated
           $0.0/mo +$0.0

```

</details>

*Pushed by: @michaeldeggers, Action: `pull_request`*